{
    "abstract": "An individualized decision rule (IDR) is a decision function that assigns each individual a given treatment based on his/her observed characteristics. Most of the existing works in the literature consider settings with binary or finitely many treatment options. In this paper, we focus on the continuous treatment setting and propose a jump interval-learning to develop an individualized interval-valued decision rule (I2DR) that maximizes the expected outcome. Unlike IDRs that recommend a single treatment, the proposed I2DR yields an interval of treatment options for each individual, making it more flexible to implement in practice. To derive an optimal I2DR, our jump interval-learning method estimates the conditional mean of the outcome given the treatment and the covariates via jump penalized regression, and derives the corresponding optimal I2DR based on the estimated outcome regression function. The regressor is allowed to be either linear for clear interpretation or deep neural network to model complex treatment-covariates interactions. To implement jump interval-learning, we develop a searching algorithm based on dynamic programming that efficiently computes the outcome regression function. Statistical properties of the resulting I2DR are established when the outcome regression function is either a piecewise or continuous function over the treatment space. We further develop a procedure to infer the mean outcome under the (estimated) optimal policy. Extensive simulations and a real data application to a Warfarin study are conducted to demonstrate the empirical validity of the proposed I2DR.",
    "authors": [
        "Hengrui Cai",
        "Chengchun Shi",
        "Rui Song",
        "Wenbin Lu"
    ],
    "emails": [
        "hengrc1@uci.edu",
        "c.shi7@lse.ac.uk",
        "rsong@ncsu.edu",
        "wlu4@ncsu.edu"
    ],
    "extra_links": [
        [
            "code",
            "https://cran.r-project.org/web/packages/JQL/index.html"
        ]
    ],
    "id": "21-0843",
    "issue": 140,
    "pages": [
        1,
        92
    ],
    "title": "Jump Interval-Learning for Individualized Decision Making with Continuous Treatments",
    "volume": 24,
    "year": 2023
}