{
    "abstract": "Quantile regression is a fundamental problem in statistical learning motivated by a need to quantify uncertainty in predictions, or to model a diverse population without being overly reductive. For instance, epidemiological forecasts, cost estimates, and revenue predictions all benefit from being able to quantify the range of possible values accurately. As such, many models have been developed for this problem over many years of research in statistics, machine learning, and related fields. Rather than proposing yet another (new) algorithm for quantile regression we adopt a meta viewpoint: we investigate methods for aggregating any number of conditional quantile models, in order to improve accuracy and robustness. We consider weighted ensembles where weights may vary over not only individual models, but also over quantile levels, and feature values. All of the models we consider in this paper can be fit using modern deep learning toolkits, and hence are widely accessible (from an implementation point of view) and scalable. To improve the accuracy of the predicted quantiles (or equivalently, prediction intervals), we develop tools for ensuring that quantiles remain monotonically ordered, and apply conformal calibration methods. These can be used without any modification of the original library of base models. We also review some basic theory surrounding quantile aggregation and related scoring rules, and contribute a few new results to this literature (for example, the fact that post sorting or post isotonic regression can only improve the weighted interval score). Finally, we provide an extensive suite of empirical comparisons across 34 data sets from two different benchmark repositories.",
    "authors": [
        "Rasool Fakoor",
        "Taesup Kim",
        "Jonas Mueller",
        "Alexander J. Smola",
        "Ryan J. Tibshirani"
    ],
    "emails": [
        "fakoor@amazon.com",
        "taesup.kim@snu.ac.kr",
        "jonas@cleanlab.ai",
        "smola@amazon.com",
        "ryantibs@cmu.edu"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/amazon-research/quantile-aggregation"
        ]
    ],
    "id": "22-0799",
    "issue": 162,
    "pages": [
        1,
        45
    ],
    "title": "Flexible Model Aggregation for Quantile Regression",
    "volume": 24,
    "year": 2023
}