{
    "abstract": "The availability of reliable, high-resolution climate and weather data is important to inform long-term decisions on climate adaptation and mitigation and to guide rapid responses to extreme events. Forecasting models are limited by computational costs and, therefore, often generate coarse-resolution predictions. Statistical downscaling, including super-resolution methods from deep learning, can provide an efficient method of upsampling low-resolution data. However, despite achieving visually compelling results in some cases, such models frequently violate conservation laws when predicting physical variables. In order to conserve physical quantities, here we introduce methods that guarantee statistical constraints are satisfied by a deep learning downscaling model, while also improving their performance according to traditional metrics. We compare different constraining approaches and demonstrate their applicability across different neural architectures as well as a variety of climate and weather data sets. Besides enabling faster and more accurate climate predictions through downscaling, we also show that our novel methodologies can improve super-resolution for satellite data and natural images data sets.",
    "authors": [
        "Paula Harder",
        "Alex Hernandez-Garcia",
        "Venkatesh Ramesh",
        "Qidong Yang",
        "Prasanna Sattegeri",
        "Daniela Szwarcman",
        "Campbell Watson",
        "David Rolnick"
    ],
    "emails": [
        "paula.harder@mila.quebec",
        "alex.hernandez-garcia@mila.quebec",
        "venkatesh.ramesh@mila.quebec",
        "qy707@nyu.edu",
        "psattig@us.ibm.com",
        "daniela.szw@ibm.com",
        "cwatson@us.ibm.com",
        "drolnick@cs.mcgill.ca"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/RolnickLab/constrained-downscaling"
        ]
    ],
    "id": "23-0158",
    "issue": 365,
    "pages": [
        1,
        40
    ],
    "title": "Hard-Constrained Deep Learning for Climate Downscaling",
    "volume": 24,
    "year": 2023
}