{
    "abstract": "Existing foundation models are trained on copyrighted material. Deploying these models can pose both legal and ethical risks when data creators fail to receive appropriate attribution or compensation. In the United States and several other countries, copyrighted content may be used to build foundation models without incurring liability due to the fair use doctrine. However, there is a caveat: If the model produces output that is similar to copyrighted data, particularly in scenarios that affect the market of that data, fair use may no longer apply to the output of the model. In this work, we emphasize that fair use is not guaranteed, and additional work may be necessary to keep model development and deployment squarely in the realm of fair use. First, we survey the potential risks of developing and deploying foundation models based on copyrighted content. We review relevant U.S. case law, drawing parallels to existing and potential applications for generating text, source code, and visual art. Experiments confirm that popular foundation models can generate content considerably similar to copyrighted material. Second, we discuss technical mitigations that can help foundation models stay in line with fair use. We argue that more research is needed to align mitigation strategies with the current state of the law. Third, we suggest that the law and technical mitigations should co-evolve. For example, coupled with other policy mechanisms, the law could more explicitly consider safe harbors when strong technical tools are used to mitigate infringement harms. This co-evolution may help strike a balance between intellectual property and innovation, which speaks to the original goal of fair use. But we emphasize that the strategies we describe here are not a panacea and more work is needed to develop policies that address the potential harms of foundation models.",
    "authors": [
        "Peter Henderson",
        "Xuechen Li",
        "Dan Jurafsky",
        "Tatsunori Hashimoto",
        "Mark A. Lemley",
        "Percy Liang"
    ],
    "emails": [
        "peter.henderson@princeton.edu",
        "lxuechen@cs.stanford.edu",
        "jurafsky@stanford.edu",
        "thashim@stanford.edu",
        "mlemley@law.stanford.edu",
        "pliang@cs.stanford.edu"
    ],
    "id": "23-0569",
    "issue": 400,
    "pages": [
        1,
        79
    ],
    "title": "Foundation Models and Fair Use",
    "volume": 24,
    "year": 2023
}